In [1]:
### Importing necessary libraries

## As usual libraries-

import numpy as np
import pandas as pd


## Data visualization libraries-

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline


## For SQL and others-

import sqlalchemy
import os
%load_ext sql

In [2]:
### Reading the given 'first_purchases.csv' file

df_1st = pd.read_csv('first_purchases.csv', sep = ',', header = 0)
df_1st.tail(3)

      first_purchase_date  user_id      purchase_id     venue_id product_line
71254            21.08.20  8124777  30619e1375g9100  414099g1879   Restaurant
71255            05.09.20  1806437  73322r5203t8792  451074q8754   Restaurant
71256            12.09.20  2835652  19665s1011b5743  159424f7959   Restaurant

In [3]:
### Understanding the data

df_1st.info()

## Following we can have a look from multi dimensional angle to the dataset, 
# such as- numbers of data entries, null values (if any), datatypes, etc.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71257 entries, 0 to 71256
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   first_purchase_date  71257 non-null  object
 1   user_id              71257 non-null  int64
 2   purchase_id          71257 non-null  object
 3   venue_id             71257 non-null  object
 4   product_line         71257 non-null  object
dtypes: int64(1), object(4)
memory usage: 2.7+ MB

In [4]:
### We will now specify 'dayfirst=True' to have the same order in the 'first_purchase_date. 
  # This will help us inserting the data as timestamp in the database

df_1st['first_purchase_date'] = pd.to_datetime(df_1st["first_purchase_date"], dayfirst= True)
df_1st.tail(3)

      first_purchase_date  user_id      purchase_id     venue_id product_line
71254          2020-08-21  8124777  30619e1375g9100  414099g1879   Restaurant
71255          2020-09-05  1806437  73322r5203t8792  451074q8754   Restaurant
71256          2020-09-12  2835652  19665s1011b5743  159424f7959   Restaurant

In [5]:
### Connecting to the database

## As we do not want to reveal our user and password we will first set the environment this way:)

user= os.getenv('SQL_USER')
password= os.getenv('SQL_PASSWORD')


## Now we will get the connection for the database

conn_str= f"mysql+pymysql://{user}:{password}@localhost:3306/mydata"   ## Connection string for the database
    
%sql $conn_str  ## Connection in action  (We will need it for %%sql shortcut command)
    
db= sqlalchemy.create_engine(conn_str) ## We can use this key if we want to have the output as dataFrame.
db

0 rows affected.

Engine(mysql+pymysql://root:***@localhost:3306/mydata)

In [6]:
%%sql

### Adding Table to the database

## We can now add the 'first_purchases' table to our database.

CREATE TABLE first_purchases(first_purchase_date timestamp, user_id int,
purchase_id varchar(20), venue_id varchar(20), product_line varchar(20))

 * mysql+pymysql://root:***@localhost:3306/mydata
0 rows affected.

[]

In [7]:
### Inserting values to the created table-
  
df_1st.to_sql('first_purchases', con= conn_str, if_exists= 'append', index= False)

In [8]:
### We will conduct the same procedure for our 'purchases.csv' dataset ###

In [9]:
### Reading the given 'purchases.csv' file-

df= pd.read_csv('purchases.csv', sep = ',', header = 0)
df.tail(3)

       purchase_date  user_id      purchase_id     venue_id  product_line
227454      25.09.20  9593213  24171k2872m5179  259816a5385    Restaurant
227455      22.10.20  5198771  84521m4320i9624  759314t6671    Restaurant
227456      28.10.20  9586470  74986v9932v5720  859489v4876  Retail store

In [10]:
### Here also we will check the 2nd dataFrame from a multidimensional angle-

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227457 entries, 0 to 227456
Data columns (total 5 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   purchase_date  227457 non-null  object
 1   user_id        227457 non-null  int64
 2   purchase_id    227457 non-null  object
 3   venue_id       227457 non-null  object
 4   product_line   227457 non-null  object
dtypes: int64(1), object(4)
memory usage: 8.7+ MB

In [11]:
### We will now specify 'dayfirst=True' to have the same order in the 'first_purchase_date. 
  # This will help us inserting the data as timestamp in the database
    
df['purchase_date'] = pd.to_datetime(df["purchase_date"], dayfirst= True)
df.tail(3)

       purchase_date  user_id      purchase_id     venue_id  product_line
227454    2020-09-25  9593213  24171k2872m5179  259816a5385    Restaurant
227455    2020-10-22  5198771  84521m4320i9624  759314t6671    Restaurant
227456    2020-10-28  9586470  74986v9932v5720  859489v4876  Retail store

In [12]:
%%sql

### Adding Table to the database

## We can now add the 'purchases' table to our database.

CREATE TABLE purchases(purchase_date timestamp, user_id int,
purchase_id varchar(20), venue_id varchar(20), product_line varchar(20))

 * mysql+pymysql://root:***@localhost:3306/mydata
0 rows affected.

[]

In [13]:
### Inserting values to the created table-

df.to_sql('purchases', con= conn_str, if_exists= 'append', index= False)